Repository: aliibsamohammed/customuser_project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: Amharic
am: አማርኛ

source: English
am: እንግሊዝኛ

source: Afaan Oromoo
am: አፋን ኦሮሞ

source: Simplified Chinese
am: ቀለል ያለ ቻይንኛ

source: I am
am: እኔ

source: A Civil Engineer and Software Engineer
am: የሲቪል መሐንዲስ እና የሶፍትዌር መሐንዲስ ነኝ

source: Project Manager and Design Engineer
am: የፕሮጀክት ሥራ አስኪያጅ እና የዲዛይን መሐንዲስ

source: Systems Analyst, Systems Architect & Programmer
am: የስርዓት ተንታኝ ፣ ሲስተምስ አርክቴክት እና ፕሮግራመር

source: This is a django customuser management app: Enjoy it
am: ይህ የጃንጎ የተጠቃሚ አስተዳደር መተግበሪያ ነው - ይደሰቱበት

source: Contact Me
am: እኔን ያነጋግሩኝ

source: Django User Management
am: የጃንጎ የተጠቃሚ አስተዳደር መተግበሪያ

source: Home
am: ሆም

source: About
am: ስለ እኛ

source: Contact
am: አግኙን

source: Admin
am: አስተዳዳሪ

source: Account
am: መለያ

source: Password
am: ፕስወርድ

source: Email
am: ኢሜል

source: Profile
am: ውጣ

source: Update
am: ቀይር

source: View
am: ይመልከቱ

source: Sign Up
am: መለያ ይመዝገቡ

source: Log In
am: ግባ መለያ

source: Change language
am: ቋንቋ ቀይር

source: Set Time Zone
am: የሰዓት ሰቅ ለውጥ

source: Select the language
am: ቋንቋውን ይምረጡ

source: Change
am: ለውጥ

source: Your username is
am: የተጠቃሚ ስምዎ

source: You are a guest.
am: እንግዳ ነዎት

source: Profile with roles
am: ሚናዎች ያሉት መገለጫ

source: Email or username option
am: ኢሜል ወይም የተጠቃሚ ስም አማራጭ

source: Account activation through e-mail
am: በኢ-ሜይል በኩል መለያ ማግበር

source: Create, Update, View and Delete Account and Profile
am: መለያ እና መገለጫ ይፍጠሩ ፣ ያሻሽሉ ፣ ይመልከቱ እና ይሰርዙ

source: Read More
am: ተጨማሪ ያንብቡ

source: Django Account Management App
am: የጃንጎ መለያ አስተዳደር መተግበሪያ

source: Accounts
am: መለያዎች

source: Registered Users
am: የተመዘገቡ ተጠቃሚዎች

source: signed up users
am: የተመዘገቡ ተጠቃሚዎች

source: signed up user
am: የተመዘገበ ተጠቃሚ

source: users
am: ተጠቃሚዎች

source: added profile
am: የተመዘገበ መገለጫ

source: user
am: ተጠቃሚ

source: added address
am: የተመዘገበ አድራሻ

source: updated
am: ተስተካክሏል

source: day ago
am: ቀናት በፊት

source: You have visited this page
am: ይህን ድረ -ገጽ ጎብኝተዋል

source: times
am: ጊዜያት

source: time
am: ጊዜ

source: Set
am: አዘጋጅ
